constant/pyrolysisZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysis
{
    active          true;

    pyrolysisModel  reactingOneDim;

    region          sampleRegion;

    reactingOneDimCoeffs
    {
        gasHSource          no; //Energy source term due to pyrolysis gas
        qrHSource           no; //Energy source term due in depth radiation

        minimumDelta        1e-6;
        moveMesh            false;
        useChemistrySolvers false;
    }

    infoOutput      true;
}

// ************************************************************************* //
