constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation on;

radiationModel  fvDOM;

fvDOMCoeffs
{
    nPhi        2;      // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta      2;      // polar angles in PI (from Z to X-Y plane)
    maxIter     5;      // maximum number of iterations
    tolerance   1e-3;   // convergence criteria for radiation iteration
}

// Number of flow iterations per radiation iteration
solverFreq 20;

absorptionEmissionModel greyMeanAbsorptionEmission;

greyMeanAbsorptionEmissionCoeffs
{
    lookUpTableFileName      none;

    EhrrCoeff                0.3;
}

scatterModel    none;

sootModel       none;

// ************************************************************************* //
