system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * *//

convertToMeters 1;

vertices
(
    (-0.05 0.0 -0.05)    //0
    ( 0.05 0.0 -0.05)    //1
    ( 0.05 0.0184 -0.05) //2
    (-0.05 0.0184 -0.05) //3

    (-0.05 0.0 0.05)     //4
    ( 0.05 0.0 0.05)     //5
    ( 0.05 0.0184 0.05)  //6
    (-0.05 0.0184 0.05)  //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 10 50) simpleGrading (1 1 1)
);

edges
(

);

patches
(
    patch back
    (
        (0 1 5 4)
    )

    patch sides
    (
        (0 4 7 3)
        (4 5 6 7)
        (5 1 2 6)
        (1 0 3 2)
    )

    patch front
    (
        (3 7 6 2)
    )
);

mergePatchPairs
(

);

// ************************************************************************* //
