system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fireFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1200;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   10.;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression on;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;

maxDi           0.25;

maxDeltaT       0.01;

/*
functions
{
    Temperatures_sample
    {
        type               probes;
        libs               ("libsampling.so");
        writeControl       runTime;
        writeInterval      0.05;
        region             sampleRegion;
        probeLocations
        (
            ( 0.0 -0.0001 0.0 )  // Near the sample surface
            ( 0.0 -0.01839 0.0 ) // Near the sample bottom
        );
        fields
        (
            T
        );
    }

    massLossRate_sample_front
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        region          sampleRegion;
        writeControl    runTime;  
        writeInterval   0.05;
        log             false;
        writeFields     false;
        regionType      patch;
        name            region0_to_sampleRegion_sample;
        surfaceFormat   vtk; 
        operation       sum;
        fields
        (
            phiGas
        );
    }
}
*/
// ************************************************************************* //
