system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region            sampleRegion;

faceZones         (sample);

oneD              true;

sampleMode        nearestPatchFace;

oneDPolyPatchType empty;

extrudeModel      linearNormal;

nLayers           40;

expansionRatio    1;

adaptMesh         true;

linearNormalCoeffs
{
    thickness     0.0184;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
