system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    div(phi,K)      Gauss limitedLinear 1;
    flux(phi,C3H8)  Gauss limitedLinear01 1;
    flux(phi,H2O)   Gauss limitedLinear01 1;
    flux(phi,CO2)   Gauss limitedLinear01 1;
    flux(phi,O2)    Gauss limitedLinear01 1;
    flux(phi,hs)    Gauss limitedLinear 1;
    div(phi,hs)     Gauss limitedLinear 1;

    div(phi,Yi_h) Gauss multivariateSelection
    {
        C3H8        limitedLinear01 1;
        H2O         limitedLinear01 1;
        CO2         limitedLinear01 1;
        O2          limitedLinear01 1;
        N2          limitedLinear01 1;
        h           limitedLinear 1;
    };
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
